docs/algorithmExplained.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-22 wo 18:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hs-Fragem</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Iris" />
</head>
<body>
<div id="content">
<h1 class="title">Hs-Fragem</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd72cd6e">Slogans:</a></li>
<li><a href="#orgcf4d719">Keywords</a></li>
<li><a href="#orgbc6d934">Parameters:</a></li>
<li><a href="#org615e155">Algorithm/Computation (producing the fractal dimension curve):</a></li>
<li><a href="#org30f68cf">Equations from Fractal dimensions:</a></li>
<li><a href="#org77ea41a">Modelling (in types)</a>
<ul>
<li><a href="#orgedefa6c">Model of music: [Time Signiture, [Voice]]</a></li>
<li><a href="#org6563843">Model of mass: [Note] -&gt; Maybe Double</a></li>
<li><a href="#orgc99528d">Model of metrical weights: TimeSig -&gt; [Int]</a></li>
<li><a href="#org04ec33d">Model of computation: midi -&gt; parameters -&gt; [[Double], [midi]]</a></li>
<li><a href="#org3d6ca1e">Data type of patterns: using threshold?</a></li>
</ul>
</li>
<li><a href="#org478194a">References: fractal inspired methods in time series analysis</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd72cd6e" class="outline-2">
<h2 id="orgd72cd6e">Slogans:</h2>
<div class="outline-text-2" id="text-orgd72cd6e">
<ul class="org-ul">
<li>Hierachical modelling based on metrical positions of notes.</li>
<li>Examine different levels of details (elaborations) in music.</li>
<li>Use visually inspired measurement for comparing between hierachies</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf4d719" class="outline-2">
<h2 id="orgcf4d719">Keywords</h2>
<div class="outline-text-2" id="text-orgcf4d719">
<ul class="org-ul">
<li>Metrical weights: assigning importance to notes based on their position on the grid given by the bars</li>
<li>Melodic reduction: Two theories in GTTM and Schenker. Could be used this the same paradigm, but we haven't implemented this yet. Relevant work from Conklin and Grooves.</li>
<li>Hierachy: Viewing music from different levels of importance /details /variation s/elaborations /ornamentations.</li>
<li>Zooming-in/out: inspired by fractal dimension calculation, going in-between hierachies, consider different levels of details</li>
<li>Mass: inspired by fractals and the visual correspondence of music objects (the uneven, irregular surface of music notes vs smooth, regular surface). A measurement for each level in the hierachy. Equals to \(\sum \sqrt{duration^2 + pitchInterval^2}\). Intuitively, it's the sum of the lengths of the holding notes and the lengths of the lines connecting the two notes when there is a pitch change.</li>
<li>Fractal/self-similarity dimension: taking ratios between different levels of mass, summarising the hierachical structure</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc6d934" class="outline-2">
<h2 id="orgbc6d934">Parameters:</h2>
<div class="outline-text-2" id="text-orgbc6d934">
<ul class="org-ul">
<li>Zoom level: 1 -&gt; consider all notes, 2 -&gt; consider notes with weights &gt;= 2, &#x2026;</li>
<li>Window size: how many bars are included in the analysis to produce one number</li>
<li>Sliding or hopping windows</li>
<li>Threshold: what is the maximum gaps between the two groups for them to be considered as belong to the same kind of pattern</li>
</ul>
</div>
</div>

<div id="outline-container-org615e155" class="outline-2">
<h2 id="org615e155">Algorithm/Computation (producing the fractal dimension curve):</h2>
<div class="outline-text-2" id="text-org615e155">
<ol class="org-ol">
<li>split the music entry into m parts, n bars per part</li>
<li>perform the following actions for each bar
<ol class="org-ol">
<li>Create hierachy:
<ol class="org-ol">
<li>take the notes in the most important positions in the bar (for example, in a 4/4 bar, we have a importance grid of [5,2,3,2,4,2,3,2] in the resolution of a quiver; so only the notes on position of the first quiver will be taken)</li>
<li>take the notes in the most and the second most important positions in the bar (we have the positions of the first and the fifth quiver in this case)</li>
<li>repeat till we consider all the importance levels</li>
</ol></li>
<li>Compute measurement (mass) on the hierachy
<ol class="org-ol">
<li>Calculate the mass within one note: = duration in quarter length</li>
<li>Calculate the mass between two notes =  \(\sum \sqrt{\Delta duration^2 + \Delta pitch^2}\) (eqv to the hypotenuse of the time and frequency difference)</li>
<li>Sum up the mass (intuitively as the length of the line tracing through the notes in considerations)</li>
</ol></li>
<li>Take ratios and the log of the mass between the selected two hierachies: $dim = log<sub>2</sub>(mass<sub>I1</sub>/mass<sub>I2</sub>)</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org30f68cf" class="outline-2">
<h2 id="org30f68cf">Equations from Fractal dimensions:</h2>
<div class="outline-text-2" id="text-org30f68cf">
<ul class="org-ul">
<li>The Definition of "Mass": \[M\propto{s}^{-D}\]</li>

<li>Definition of "Fractal Dimension": \[-D=\frac{logM}{logs}\]</li>
</ul>
</div>
</div>

<div id="outline-container-org77ea41a" class="outline-2">
<h2 id="org77ea41a">Modelling (in types)</h2>
<div class="outline-text-2" id="text-org77ea41a">
</div>
<div id="outline-container-orgedefa6c" class="outline-3">
<h3 id="orgedefa6c">Model of music: [Time Signiture, [Voice]]</h3>
<div class="outline-text-3" id="text-orgedefa6c">
<p>
This is the model we chose at the beginning of this project. (Not too restricted? We thought of incorporating for dimensions such as accents or dynamics. But is it better to focus on the metric structure only? It puts a limitation on the available corpora, but within the scope, it can be useful and already giving interesting results.)
</p>
</div>
</div>
<div id="outline-container-org6563843" class="outline-3">
<h3 id="org6563843">Model of mass: [Note] -&gt; Maybe Double</h3>
<div class="outline-text-3" id="text-org6563843">
<p>
The types give much freedom to how we could calculate the "mass". We choose the length for now for the corresponding visual contours in music. For polyphony, we can extend this to the area enclosed by two voices, and it can capture the amount of contrary motions in the piece, which is crucial for counterpoint. 
</p>
</div>
</div>
<div id="outline-container-orgc99528d" class="outline-3">
<h3 id="orgc99528d">Model of metrical weights: TimeSig -&gt; [Int]</h3>
<div class="outline-text-3" id="text-orgc99528d">
<p>
For each time signiture, we assign a list of integers of importance values to the positions of notes. Now we have a quiver as the resolution of the grid of the positions. New time signitures can be added and the resolution can be changed. 
</p>
</div>
</div>
<div id="outline-container-org04ec33d" class="outline-3">
<h3 id="org04ec33d">Model of computation: midi -&gt; parameters -&gt; [[Double], [midi]]</h3>
<div class="outline-text-3" id="text-org04ec33d">
<p>
The input of frahem is midi files. From the parameters we introduced above, we can specify on which time scale and how many levels of hierachies we would like to analyse. The output is a time series of the fractal/self-similarity dimension. Based on the dimensions, we can also generate the patterns in the midi format with the same dimensions or up to a threshold. 
</p>
</div>
</div>
<div id="outline-container-org3d6ca1e" class="outline-3">
<h3 id="org3d6ca1e">Data type of patterns: using threshold?</h3>
<div class="outline-text-3" id="text-org3d6ca1e">
<p>
Might be a way to model patterns using the fractal dimensions. The type of patterns dependent on the threshold value? 
</p>
</div>
</div>
</div>

<div id="outline-container-org478194a" class="outline-2">
<h2 id="org478194a">References: fractal inspired methods in time series analysis</h2>
<div class="outline-text-2" id="text-org478194a">
<ul class="org-ul">
<li>Kantz, H., &amp; Schreiber, T. (2004). Nonlinear time series analysis (Vol. 7). Cambridge university press.</li>
<li>Chakrabarti, D., &amp; Faloutsos, C. (2002, November). F4: large-scale automated forecasting using fractals. In Proceedings of the eleventh international conference on Information and knowledge management (pp. 2-9). ACM.</li>
<li>Higuchi, Tomoyuki. "Approach to an irregular time series on the basis of the fractal theory." Physica D: Nonlinear Phenomena 31.2 (1988): 277-283.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Iris</p>
<p class="date">Created: 2018-08-22 wo 18:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
