docs/tryingformats/algorithmExplained.tex
% Created 2018-08-22 wo 18:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{natbib}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\author{Iris}
\date{\today}
\title{Hs-Fragem}
\hypersetup{
 pdfauthor={Iris},
 pdftitle={Hs-Fragem},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section*{Slogans:}
\label{sec:org0680de9}
\begin{itemize}
\item Hierachical modelling based on metrical positions of notes.
\item Examine different levels of details (elaborations) in music.
\item Use visually inspired measurement for comparing between hierachies
\end{itemize}

\section*{Keywords}
\label{sec:orgac07f33}
\begin{itemize}
\item Metrical weights: assigning importance to notes based on their position on the grid given by the bars
\item Melodic reduction: Two theories in GTTM and Schenker. Could be used this the same paradigm, but we haven't implemented this yet. Relevant work from Conklin and Grooves.
\item Hierachy: Viewing music from different levels of importance /details /variation s/elaborations /ornamentations.
\item Zooming-in/out: inspired by fractal dimension calculation, going in-between hierachies, consider different levels of details
\item Mass: inspired by fractals and the visual correspondence of music objects (the uneven, irregular surface of music notes vs smooth, regular surface). A measurement for each level in the hierachy. Equals to \(\sum \sqrt{duration^2 + pitchInterval^2}\). Intuitively, it's the sum of the lengths of the holding notes and the lengths of the lines connecting the two notes when there is a pitch change.
\item Fractal/self-similarity dimension: taking ratios between different levels of mass, summarising the hierachical structure
\end{itemize}

\section*{Parameters:}
\label{sec:org1c370dd}
\begin{itemize}
\item Zoom level: 1 -> consider all notes, 2 -> consider notes with weights >= 2, \ldots{}
\item Window size: how many bars are included in the analysis to produce one number
\item Sliding or hopping windows
\item Threshold: what is the maximum gaps between the two groups for them to be considered as belong to the same kind of pattern
\end{itemize}

\section*{Algorithm/Computation (producing the fractal dimension curve):}
\label{sec:orgd29220c}
\begin{enumerate}
\item split the music entry into m parts, n bars per part
\item perform the following actions for each bar
\begin{enumerate}
\item Create hierachy:
\begin{enumerate}
\item take the notes in the most important positions in the bar (for example, in a 4/4 bar, we have a importance grid of [5,2,3,2,4,2,3,2] in the resolution of a quiver; so only the notes on position of the first quiver will be taken)
\item take the notes in the most and the second most important positions in the bar (we have the positions of the first and the fifth quiver in this case)
\item repeat till we consider all the importance levels
\end{enumerate}
\item Compute measurement (mass) on the hierachy
\begin{enumerate}
\item Calculate the mass within one note: = duration in quarter length
\item Calculate the mass between two notes =  \(\sum \sqrt{\Delta duration^2 + \Delta pitch^2}\) (eqv to the hypotenuse of the time and frequency difference)
\item Sum up the mass (intuitively as the length of the line tracing through the notes in considerations)
\end{enumerate}
\item Take ratios and the log of the mass between the selected two hierachies: \$dim = log\(_{\text{2}}\)(mass\(_{\text{I1}}\)/mass\(_{\text{I2}}\))
\end{enumerate}
\end{enumerate}

\section*{Equations from Fractal dimensions:}
\label{sec:orge455160}
\begin{itemize}
\item The Definition of "Mass": $$M\propto{s}^{-D}$$

\item Definition of "Fractal Dimension": $$-D=\frac{logM}{logs}$$
\end{itemize}

\section*{Modelling (in types)}
\label{sec:org564682a}
\subsection*{Model of music: [Time Signiture, [Voice]]}
\label{sec:orgb7b02d6}
This is the model we chose at the beginning of this project. (Not too restricted? We thought of incorporating for dimensions such as accents or dynamics. But is it better to focus on the metric structure only? It puts a limitation on the available corpora, but within the scope, it can be useful and already giving interesting results.)
\subsection*{Model of mass: [Note] -> Maybe Double}
\label{sec:org37199d7}
The types give much freedom to how we could calculate the "mass". We choose the length for now for the corresponding visual contours in music. For polyphony, we can extend this to the area enclosed by two voices, and it can capture the amount of contrary motions in the piece, which is crucial for counterpoint. 
\subsection*{Model of metrical weights: TimeSig -> [Int]}
\label{sec:org6e0d68e}
For each time signiture, we assign a list of integers of importance values to the positions of notes. Now we have a quiver as the resolution of the grid of the positions. New time signitures can be added and the resolution can be changed. 
\subsection*{Model of computation: midi -> parameters -> [[Double], [midi]]}
\label{sec:orgf7a9dae}
The input of frahem is midi files. From the parameters we introduced above, we can specify on which time scale and how many levels of hierachies we would like to analyse. The output is a time series of the fractal/self-similarity dimension. Based on the dimensions, we can also generate the patterns in the midi format with the same dimensions or up to a threshold. 
\subsection*{Data type of patterns: using threshold?}
\label{sec:org8c50b4c}
Might be a way to model patterns using the fractal dimensions. The type of patterns dependent on the threshold value? 

\section*{References: fractal inspired methods in time series analysis}
\label{sec:orgaa5d4d1}
\begin{itemize}
\item Kantz, H., \& Schreiber, T. (2004). Nonlinear time series analysis (Vol. 7). Cambridge university press.
\item Chakrabarti, D., \& Faloutsos, C. (2002, November). F4: large-scale automated forecasting using fractals. In Proceedings of the eleventh international conference on Information and knowledge management (pp. 2-9). ACM.
\item Higuchi, Tomoyuki. "Approach to an irregular time series on the basis of the fractal theory." Physica D: Nonlinear Phenomena 31.2 (1988): 277-283.
\end{itemize}
\end{document}